


var data = {
    "month": {
        "monthly": ["2018年4月", "2018年5月"]
    },
    "nameAndRateOperation": {
        "济南华阳炭素有限公司": ["91.67", "91.67"],
        "济南万瑞炭素有限责任公司": ["84", "84"],
        "济南龙山炭素有限公司": ["85.71", "85.71"],
        "德州欧莱恩永兴碳素有限公司": ["70", "80"],
        "德州永兴碳素有限公司": ["90", "90"],
        "德州乾海碳素有限公司": ["70", "75"],
        "济南海川投资集团有限公司": ["81.25", "81.25"],
        "济南汇丰炭素有限公司": ["86", "86"],
        "山东金利达碳素有限公司": ["86.68", "80"],
        "济南澳海炭素有限公司": ["85", "85"]
    },
    "nameAndYield": {
        "济南华阳炭素有限公司": ["1.2", "1.2"],
        "济南万瑞炭素有限责任公司": ["4", "4"],
        "济南龙山炭素有限公司": ["2.4", "2.4"],
        "德州欧莱恩永兴碳素有限公司": ["0.8", "1"],
        "德州永兴碳素有限公司": ["0.67", "0.5"],
        "德州乾海碳素有限公司": ["0.2", "0.25"],
        "济南海川投资集团有限公司": ["1.6", "1.6"],
        "济南汇丰炭素有限公司": ["0.8", "0.8"],
        "山东金利达碳素有限公司": ["2", "2.5"],
        "济南澳海炭素有限公司": ["4.33", "4.5"]
    },
    "nameAndDateTime": {
        "济南华阳炭素有限公司": ["2018年4月", "2018年5月"],
        "济南万瑞炭素有限责任公司": ["2018年4月", "2018年5月"],
        "济南龙山炭素有限公司": ["2018年4月", "2018年5月"],
        "德州欧莱恩永兴碳素有限公司": ["2018年4月", "2018年5月"],
        "德州永兴碳素有限公司": ["2018年4月", "2018年5月"],
        "德州乾海碳素有限公司": ["2018年4月", "2018年5月"],
        "济南海川投资集团有限公司": ["2018年4月", "2018年5月"],
        "济南汇丰炭素有限公司": ["2018年4月", "2018年5月"],
        "山东金利达碳素有限公司": ["2018年4月", "2018年5月"],
        "济南澳海炭素有限公司": ["2018年4月", "2018年5月"]
    },
    "regionAndCompany": {
        "华东": ["德州欧莱恩永兴碳素有限公司", "德州乾海碳素有限公司", "德州永兴碳素有限公司", "山东金利达碳素有限公司", "济南澳海炭素有限公司", "济南海川投资集团有限公司", "济南华阳炭素有限公司", "济南汇丰炭素有限公司", "济南龙山炭素有限公司", "济南万瑞炭素有限责任公司"]
    },
    "nameAndCapacity": {
        "济南华阳炭素有限公司": ["6", "6"],
        "济南万瑞炭素有限责任公司": ["5", "5"],
        "济南龙山炭素有限公司": ["7", "7"],
        "德州欧莱恩永兴碳素有限公司": ["30", "30"],
        "德州永兴碳素有限公司": ["20", "20"],
        "德州乾海碳素有限公司": ["20", "20"],
        "济南海川投资集团有限公司": ["8", "8"],
        "济南汇丰炭素有限公司": ["10", "10"],
        "山东金利达碳素有限公司": ["15", "15"],
        "济南澳海炭素有限公司": ["10", "10"]
    },
    "storageWithCompany": {
        "济南华阳炭素有限公司": ["0.8", "0.8"],
        "济南万瑞炭素有限责任公司": ["3.2", "3.2"],
        "济南龙山炭素有限公司": ["2.2", "2.2"],
        "德州欧莱恩永兴碳素有限公司": ["1.2", "1.2"],
        "德州永兴碳素有限公司": ["0.5", "0.5"],
        "德州乾海碳素有限公司": ["0.15", "0.15"],
        "济南海川投资集团有限公司": ["1", "1"],
        "济南汇丰炭素有限公司": ["0.5", "1"],
        "山东金利达碳素有限公司": ["1.5", "1.5"],
        "济南澳海炭素有限公司": ["2.5", "2.5"]
    }
}


for (var key in data.regionAndCompany) {
    region.push(key);
}
console.log(region)